package hw1;

public class task1 {
    // main в Java – это обычно первый метод, и он является точкой входа в программирование на Java.
    // Метод main может содержать код для выполнения или вызова других методов и его можно вложить в любой класс, который является частью программы.


    public static void main(String[]args){
        String name = "Миша";
        System.out.println("Меня зовут " + name + " и я родился в городе Мариуполь");
        byte age = 20;
        System.out.println("Мне " + age + " лет");
        short year = 2022;
        System.out.println("В " + year + " я как переселенец переехал в город Днепр");
        String city1 = "Мариуполе";
        System.out.println("В " + city1 + " у меня была цель стать хорошим фотографом, обучался и практиковался долгое время и мне это нравилось");
        String cars = "машины";
        System.out.println("Также я любил " + cars + ", как и большинство ребят в моем возрасте");
        String str1 = "прав";
        System.out.println("Отец подарил мне мою первую машину в 19, это была именно та которую я хотел и была нам по карману ");
        System.out.println("Так как у меня не было " + str1 + ", меня часто останавливали полицейские и отцу приходилось решать мои проблемы" );
        System.out.println("Я очень люблю свой город, и верю в его освобождение, я пережил очень многое там, потерял много своих друзей, а некоторых прям на глазах");
        System.out.println("Так как мы выехали и остались практически ни с чем, я искал работу что б были какие то деньги, остановились мы в Днепре но работать уехал я в Киев, так как там было больше возможностей");
        System.out.println("Я проработал 3 месяца на складе и компании которая основана на медикаментах, также собирали для наших военных лекарства");
        String str2 = "программист";
        System.out.println("Позже мне поступило предложение от моего знакомого, он " + str2 + ", он достаточно успешен в IT сфере и работает на казино, пишет для них код");
        System.out.println("Он дал мне возможность изучать и все комфортное для обучения и дальнейшей работы, и я очень благодарен ему за это");
        String str3 = "подошел к концу";
        System.out.println("Вот и " + str3 + " мой оооочень краткий рассказ про свою жизнь, и это первое мое ДЗ с джавой и написанием вот этого всего, мне очень нравится");



    }
}
